nxp-mcuxpresso/mcuxsdk-examples/_boards/kw47loc/project_template/cm33_core0/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFlashPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitFlashPins(void)
{
    /* Clock Config: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortB);

    const port_pin_config_t FLASH_CS = {/* Internal pull-up/down resistor is disabled */
                                        .pullSelect = (uint16_t)kPORT_PullDisable,
                                        /* Low internal pull resistor value is selected. */
                                        .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                        /* Fast slew rate is configured */
                                        .slewRate = (uint16_t)kPORT_FastSlewRate,
                                        /* Passive input filter is disabled */
                                        .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                        /* Open drain output is disabled */
                                        .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                        /* Low drive strength is configured */
                                        .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                        /* Normal drive strength is configured */
                                        .driveStrength1 = (uint16_t)kPORT_NormalDriveStrength,
                                        /* Pin is configured as LPSPI1_PCS0 */
                                        .mux = (uint16_t)kPORT_MuxAlt2,
                                        /* Digital input is not inverted */
                                        .invertInput = (uint16_t)kPORT_InputNormal,
                                        /* Pin Control Register fields [15:0] are not locked */
                                        .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORTB0 (pin 46) is configured as LPSPI1_PCS0 */
    PORT_SetPinConfig(BOARD_INITFLASHPINS_FLASH_CS_PORT, BOARD_INITFLASHPINS_FLASH_CS_PIN, &FLASH_CS);

    const port_pin_config_t FLASH_SIN = {/* Internal pull-up/down resistor is disabled */
                                         .pullSelect = (uint16_t)kPORT_PullDisable,
                                         /* Low internal pull resistor value is selected. */
                                         .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                         /* Fast slew rate is configured */
                                         .slewRate = (uint16_t)kPORT_FastSlewRate,
                                         /* Passive input filter is disabled */
                                         .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                         /* Open drain output is disabled */
                                         .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                         /* Low drive strength is configured */
                                         .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                         /* Normal drive strength is configured */
                                         .driveStrength1 = (uint16_t)kPORT_NormalDriveStrength,
                                         /* Pin is configured as LPSPI1_SIN */
                                         .mux = (uint16_t)kPORT_MuxAlt2,
                                         /* Digital input is not inverted */
                                         .invertInput = (uint16_t)kPORT_InputNormal,
                                         /* Pin Control Register fields [15:0] are not locked */
                                         .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORTB1 (pin 47) is configured as LPSPI1_SIN */
    PORT_SetPinConfig(BOARD_INITFLASHPINS_FLASH_SIN_PORT, BOARD_INITFLASHPINS_FLASH_SIN_PIN, &FLASH_SIN);

    const port_pin_config_t FLASH_SCK = {/* Internal pull-up/down resistor is disabled */
                                         .pullSelect = (uint16_t)kPORT_PullDisable,
                                         /* Low internal pull resistor value is selected. */
                                         .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                         /* Fast slew rate is configured */
                                         .slewRate = (uint16_t)kPORT_FastSlewRate,
                                         /* Passive input filter is disabled */
                                         .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                         /* Open drain output is disabled */
                                         .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                         /* Low drive strength is configured */
                                         .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                         /* Normal drive strength is configured */
                                         .driveStrength1 = (uint16_t)kPORT_NormalDriveStrength,
                                         /* Pin is configured as LPSPI1_SCK */
                                         .mux = (uint16_t)kPORT_MuxAlt2,
                                         /* Digital input is not inverted */
                                         .invertInput = (uint16_t)kPORT_InputNormal,
                                         /* Pin Control Register fields [15:0] are not locked */
                                         .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORTB2 (pin 48) is configured as LPSPI1_SCK */
    PORT_SetPinConfig(BOARD_INITFLASHPINS_FLASH_SCK_PORT, BOARD_INITFLASHPINS_FLASH_SCK_PIN, &FLASH_SCK);

    const port_pin_config_t FLASH_SOUT = {/* Internal pull-up/down resistor is disabled */
                                          .pullSelect = (uint16_t)kPORT_PullDisable,
                                          /* Low internal pull resistor value is selected. */
                                          .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                          /* Fast slew rate is configured */
                                          .slewRate = (uint16_t)kPORT_FastSlewRate,
                                          /* Passive input filter is disabled */
                                          .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                          /* Open drain output is disabled */
                                          .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                          /* Low drive strength is configured */
                                          .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                          /* Normal drive strength is configured */
                                          .driveStrength1 = (uint16_t)kPORT_NormalDriveStrength,
                                          /* Pin is configured as LPSPI1_SOUT */
                                          .mux = (uint16_t)kPORT_MuxAlt2,
                                          /* Digital input is not inverted */
                                          .invertInput = (uint16_t)kPORT_InputNormal,
                                          /* Pin Control Register fields [15:0] are not locked */
                                          .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORTB3 (pin 1) is configured as LPSPI1_SOUT */
    PORT_SetPinConfig(BOARD_INITFLASHPINS_FLASH_SOUT_PORT, BOARD_INITFLASHPINS_FLASH_SOUT_PIN, &FLASH_SOUT);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
